package org.example.namesdb.user.service;

import lombok.Getter;
import lombok.Setter;

import java.util.Random;

public class NamesGenerator {
    private final String[]  maleNames = {"Артем", "Дмитрий", "Николай", "Сергей", "Виктор", "Павел",
            "Григорий", "Владимир", "Илья", "Станислав", "Роман", "Андрей", "Валентин", "Петр", "Михаил", "Василий",
            "Вадим", "Егор", "Платон", "Всеволод", "Константин", "Анатолий", "Валерий", "Олег", "Арсений",
            "Виталий", "Петр", "Милан", "Геннадий", "Евгений", "Владислав", "Валериян", "Денис", "Вера", "Руслан",
            "Павел", "Борис", "Родион", "Тимур", "Платон", "Игнат", "Юрий", "Валерий", "Святослав", "Валерий",
            "Федор", "Никита", "Семен", "Ярослав", "Влад", "Эдуард", "Антон", "Тимофей", "Игорь",
            "Даниил", "Руслан", "Степан", "Богдан", "Владислав", "Герман", "Илья", "Андрей", "Данила", "Матвей",
            "Максим", "Игорь", "Алексей", "Семен", "Артем", "Анатолий", "Глеб", "Артур",
            "Александр", "Михаил", "Иван", "Павел", "Никита", "Сергей", "Алексей", "Владимир"
    };
    private final  String[] maleLastName = {"Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов", "Михайлов", "Федоров", "Соколов", "Яковлев", "Попов",
            "Андреев", "Новиков", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов",
            "Степанов", "Николаев", "Орлов", "Антонов", "Григорьев", "Васнецов", "Денисов", "Тихонов", "Фомин", "Котов",
            "Виноградов", "Зайцев", "Макаров", "Архипов", "Белов", "Медведев", "Герасимов", "Крылов", "Титов", "Куликов",
            "Карпов", "Афанасьев", "Власов", "Филатов", "Прокофьев", "Жуков", "Баранов", "Гусев", "Калашников", "Гришин",
            "Якушев", "Горбунов", "Кудрявцев", "Быков", "Маслов", "Родионов", "Колесников", "Сазонов", "Цветков", "Дмитриев",
            "Королев", "Герман", "Ефимов", "Артемьев", "Захаров", "Савельев", "Трофимов", "Щербаков", "Логинов", "Голубев",
            "Панов", "Ширяев", "Яшин", "Карасев", "Сурков", "Сорокин", "Лазарев", "Воронин", "Сергеев", "Поляков",
            "Кондратьев", "Беляев", "Кузьмин", "Васильев", "Скворцов", "Мартынов", "Емельянов", "Горбачев", "Третьяков", "Бирюков",
            "Шарапов", "Ларионов", "Белоусов", "Рожков", "Игнатьев"
    };
    private final String[] femaleNames = {"Мария", "Екатерина", "София", "Анна", "Ольга",
            "Татьяна", "Ирина", "Елена", "Алиса", "Надежда", "Ксения", "Милана", "Евгения", "Ангелина", "Людмила",
            "Арина", "Анжелика", "Ева", "Валентина", "Алина", "Светлана", "Маргарита", "Антонина", "Юлия", "Дарья",
            "Жанна", "Майя", "Эльвира", "Вера", "Лариса", "Валерия", "Наталья", "Юлиана", "Анисья", "Софья",
            "Анастасия", "Алена", "Виктория", "Ульяна", "Виолетта", "Регина", "Полина", "Есения", "Инна", "Раиса",
            "Виола", "Эмилия", "Лидия", "Галина", "Лилия", "Артемида", "Зинаида", "Василиса", "Яна", "Серафима",
            "Роза", "Тамара", "Фаина", "Лиана", "Диана", "Марина", "Лилиана", "Инесса", "Альбина", "Ярослава",
            "Эльза", "Луиза", "Регина", "Эвелина", "Наталия", "Эльмира", "Эвелина", "Антонина", "Снежана", "Мирослава",
            "Инга", "Юлиетта", "Розалия", "Зарина", "Лидия", "Марфа", "Лариса", "Оксана", "Эльмира",
            "Ярослава", "Лидия", "Маргарита", "Алевтина", "Розалия", "Нина", "Лилия", "Изольда", "Марина", "Ираида"
    };
    private final String[] femaleLastName = {"Иванова", "Петрова", "Сидорова", "Кузнецова", "Смирнова", "Михайлова", "Федорова", "Соколова", "Яковлева",
            "Андреева", "Новикова", "Морозова", "Волкова", "Алексеева", "Лебедева", "Семенова", "Егорова", "Павлова", "Козлова", "Попова",
            "Степанова", "Николаева", "Орлова", "Антонова", "Григорьева", "Васнецова", "Денисова", "Тихонова", "Фомина", "Котова",
            "Виноградова", "Зайцева", "Макарова", "Архипова", "Белова", "Медведева", "Герасимова", "Крылова", "Титова", "Куликова",
            "Карпова", "Афанасьева", "Власова", "Филатова", "Прокофьева", "Жукова", "Баранова", "Гусева", "Калашникова", "Гришина",
            "Якушева", "Горбунова", "Кудрявцева", "Быкова", "Маслова", "Родионова", "Колесникова", "Сазонова", "Цветкова", "Дмитриева",
            "Королева", "Германа", "Ефимова", "Артемьева", "Захарова", "Савельева", "Трофимова", "Щербакова", "Логинова", "Голубева",
            "Панова", "Ширяева", "Яшинa", "Карасева", "Суркова", "Сорокинa", "Лазарева", "Воронина", "Сергеева", "Полякова",
            "Кондратьева", "Беляева", "Кузьмина", "Васильева", "Скворцова", "Мартынова", "Емельянова", "Горбачева", "Третьякова", "Бирюкова",
            "Шарапова", "Ларионова", "Белоусова", "Рожкова", "Игнатьева"
    };
    @Getter
    @Setter
    public static class Name {
        private String firstName;
        private String lastName;
    }

    public Name generate() {
        Random r = new Random();

        Boolean isMale = r.nextBoolean();

        if (isMale) {
            Name name = new Name();
            name.setFirstName(maleNames[r.nextInt(maleNames.length - 1)]);
            name.setLastName(maleLastName[r.nextInt(maleLastName.length - 1)]);
            return name;
        } else {
            Name name = new Name();
            name.setFirstName(femaleNames[r.nextInt(femaleNames.length - 1)]);
            name.setLastName(femaleLastName[r.nextInt(femaleLastName.length - 1)]);
            return name;
        }
    }
}
